import Link from 'next/link';

import { Meta } from '@/layout/Meta';
import { Main } from '@/templates/Main';

export default function Privacy() {
  return (
    <Main
      meta={
        <Meta
          title="Open data survey: นโยบายความเป็นส่วนตัว"
          description="นโยบายความเป็นส่วนตัว ของ Open data survey"
        />
      }
    >
      <div className="container mx-auto prose bg-slate-50 p-5">
        <div className="flex flex-row items-center">
          <Link href={'/'} passHref>
            <img className={`h-10`} src={`/assets/logo/digi.png`} alt="DIGI" />
          </Link>
          <h1 className="flex-1 text-center">นโยบายความเป็นส่วนตัว</h1>
        </div>

        <p>
          แอปพลิเคชันนี้เป็นการให้บริการทางดิจิทัลที่พัฒนาและดูแลโดย สพร. ซึ่ง
          สพร. มีการคำนึงถึงความเป็นส่วนตัวของท่านผู้ใช้งานเป็นสิ่งสำคัญที่สุด
          โดยนโยบายนี้เป็นส่วนหนึ่งของข้อตกลงการใช้งาน
          ซึ่งในนโยบายจะแจ้งท่านถึงวิธีการและแนวทางปฏิบัติ
          ตลอดจนการรักษาความมั่นคงปลอดภัยและการคุ้มครองข้อมูลส่วนบุคคลของ สพร.
        </p>

        <p>
          สำหรับนิยามคำว่า “ข้อมูลส่วนบุคคล” ตามนโยบายนี้หมายถึง ข้อมูลใดๆ
          หรือข้อมูลที่ประกอบกันและสามารถเชื่อมโยงถึงตัวท่าน
          และสามารถถูกนำไปใช้ในการระบุตัวตนของท่าน อย่างไรก็ดี สพร.
          จะไม่มีการจัดเก็บข้อมูลส่วนตัวของท่านเมื่อท่านเข้าเยี่ยมชมหรือใช้งานบริการดิจิทัลนี้
        </p>

        <h2>ข้อมูลส่วนบุคคลและการใช้ข้อมูล</h2>

        <p>
          โดยปกติ สพร. จะไม่มีการจัดเก็บข้อมูลส่วนตัวของท่าน
          เว้นแต่ท่านเลือกที่จะให้ข้อมูลดังกล่าวกับ สพร. เช่น อีเมล์
          หรือการกรอกข้อมูลผ่านแบบฟอร์มหรือช่องทางที่ สพร. จัดไว้ให้ เป็นต้น
          เพื่อจะติดต่อหรือมีข้อเสนอแนะ ขอความช่วยเหลือจาก สพร. ซึ่ง สพร.
          จะจัดเก็บข้อมูลส่วนตัวดังกล่าวของท่านรวมถึงข้อมูลส่วนตัวอื่นใดที่ท่านให้ไว้
          เช่น อีเมล์ ชื่อ เป็นต้น
          แต่ท่านต้องไม่ให้ข้อมูลส่วนตัวอื่นหรือข้อมูลที่อ่อนไหว (sensitive
          information) ของท่านกับ สพร.
        </p>

        <p>
          ทั้งนี้ สพร. จะใช้ข้อมูลของท่านเพื่อตอบสนองต่อข้อร้องเรียน
          ข้อเรียกร้อง ข้อเสนอแนะหรือการขอความช่วยเหลือที่ท่านได้แจ้งกับ สพร.
          เท่านั้น
        </p>

        <a id="complaint">
          <h2>การจัดการกับข้อร้องเรียนหรือข้อเรียกร้อง</h2>
        </a>

        <p>
          ท่านสามารถร้องขอที่จะเข้าถึงข้อมูลส่วนตัวที่ สพร. จัดเก็บอยู่ได้
          รวมถึงขอให้ สพร. แก้ไขข้อมูลส่วนตัวของท่านให้ถูกต้องและเป็นปัจจุบัน
          รวมถึงสามารถร้องเรียนเกี่ยวกับการจัดการข้อมูลส่วนตัวของท่านได้
        </p>

        <p>
          เพื่อปกป้องความเป็นส่วนตัวของท่านรวมถึงของทุกคนที่มีการใช้งานแอปพลิเคชันนี้
          สพร.
          จำเป็นต้องมีหลักฐานในการยืนยันตัวตนของท่านก่อนที่จะอนุญาตให้ท่านเข้าถึงข้อมูลดังกล่าวหรือเพื่อแก้ไขข้อมูลดังกล่าวตามที่ท่านร้องขอ
        </p>

        <a id="protection">
          <h2>การคุ้มครองข้อมูลส่วนตัวของท่าน</h2>
        </a>
        <p>
          บริการดิจิทัลของ สพร.
          ซึ่งรวมถึงแอปพลิเคชันนี้มีการวางอยู่ในระบบคอมพิวเตอร์ที่มีความมั่นคงปลอดภัยและอยู่ในประเทศไทย
          ภายใต้การดูแลของ สพร. ซึ่ง สพร.
          ตระหนักถึงความไว้วางใจของท่านที่ได้ให้ข้อมูลที่สำคัญผ่านการใช้บริการของ
          สพร. โดย สพร. จะใช้ความพยายามสูงสุดตามมาตรฐานสากล
          เพื่อปกป้องคุ้มครองข้อมูลส่วนตัวของท่านให้มีความปลอดภัย
        </p>

        <p>
          อย่างไรก็ดี สพร. ขอให้ข้อมูลกับท่านว่า
          ปัจจุบันไม่มีวิธีการหรือมาตรการปกป้องรักษาความมั่นคงปลอดภัยของระบบคอมพิวเตอร์ใดที่สมบูรณ์แบบหรือไม่มีช่องโหว่ที่ป้องกันภัยคุกคามทางไซเบอร์ได้ทั้งหมด
          ประกอบกับอาจมีบุคคลภายนอกที่พยายามดักข้อมูลหรือทำการใดๆ
          เพื่อเข้าถึงข้อมูลระหว่างการส่งข้อมูลหรือเข้ามาในระบบของท่านหรือของ
          สพร. อย่างไม่มีสิทธิตามกฎหมาย ดังนั้น แม้ว่า สพร.
          จะปฏิบัติหน้าที่อย่างสุดความสามารถในการป้องกันข้อมูลส่วนตัวของท่าน แต่
          สพร.
          ไม่อาจรับประกันได้ว่าข้อมูลของท่านจะปลอดภัยแน่นอนจากภัยคุกคามและท่านไม่ควรคาดหวังว่าข้อมูลส่วนบุคคลหรือข้อมูลการติดต่อสื่อสารของท่านจะยังเป็นความลับอยู่เสมอ
          ดังนั้น
          หากเกิดกรณีที่ข้อมูลส่วนตัวของท่านถูกจารกรรมโดยวิธีการทางอิเล็กทรอนิกส์
          หรือสูญหาย เสียหายอันเนื่องจากเหตุสุดวิสัยหรือไม่ว่ากรณีใดๆ ทั้งสิ้น
          สพร. ขอสงวนสิทธิ์ในการปฏิเสธความรับผิดจากเหตุดังกล่าวทั้งหมด แต่ สพร.
          ยินดีที่จะช่วยเหลือท่านสุดความสามารถเท่าที่ สพร. จะทำได้
        </p>

        <a id="deletion">
          <h2>การลบข้อมูลส่วนตัวของท่าน</h2>
        </a>
        <p>
          ท่านสามารถลบข้อมูลส่วนตัวของท่านที่ สพร. จัดเก็บในระบบนี้ได้ทั้งหมด
          โดยเข้าส่งคำร้องขอลบข้อมูลได้ทาง contact@dga.or.th
          ซึ่งจะทำการลบข้อมูลส่วนตัวของท่านภายใน 3 วันทำการ แต่ข้อมูลบางส่วนเช่น
          การโหวด และข้อมูลอื่นๆ
          ที่ไม่เกี่ยวข้องกับข้อมูลส่วนตัวของท่านที่ท่านทำการเพิ่มเติม/แสดงความคิดเห็น
          อาจจะไม่ได้ถูกลบไปเพื่อตอบสนองต่อความสมบูรณ์ในการออกความเห็นสาธารณะ
        </p>

        <p>
          โดยปกติ สพร.
          จะทำลายข้อมูลที่จัดเก็บเมื่อบรรลุวัตถุประสงค์ในการใช้ข้อมูลดังกล่าวแล้ว
          อย่างไรก็ดี สพร. อาจต้องมีการเก็บรักษาข้อมูลส่วนตัวที่ท่าน
          หรือข้อมูลอื่นใดที่เกี่ยวกับท่านที่ได้ให้ไว้กับ สพร.
          นานกว่าที่กำหนดเพื่อให้เป็นไปตามข้อกำหนดของกฎหมายที่เกี่ยวข้อง
        </p>

        <a id="third-party">
          <h2>การให้บริการของบุคคลที่สามในบริการของ สพร.</h2>
        </a>

        <p>
          การให้บริการในแอปพลิเคชันของ สพร.
          บางครั้งอาจมีการร่วมกับบุคคลที่สามในการแบ่งปันหน้าที่เพื่อให้การให้บริการมีประสิทธิภาพและอำนวยความสะดวกกับท่านผู้ใช้งานมากยิ่งขึ้น
          โดย สพร. อาจขอให้บุคคลที่สามช่วยเหลือในการประมวลผล
          และหรือจัดเก็บรักษาข้อมูลส่วนตัวของท่าน โดย สพร.
          จะประเมินการดำเนินงานของบุคคลที่สามอย่างเข้มงวด
          เพื่อให้มั่นใจว่าบุคคลเหล่านี้มีการบริหารจัดการข้อมูลที่เหมาะสมและปลอดภัย
          และมีระบบควบคุมการบริหารจัดการองค์กร และ สพร.
          จะกำหนดให้บุคคลเหล่านี้ต้องมีการปฏิบัติตามกฎหมายและกฎระเบียบที่เกี่ยวข้องอย่างเคร่งครัด
          รวมถึงกำหนดให้บุคคลเหล่านี้เข้าถึงข้อมูลของท่านได้เท่าที่จำเป็นเพื่อการปรับปรุงการให้บริการเท่านั้น
        </p>

        <p>
          นอกจากนี้ บริการในแอปพลิเคชันของ สพร.
          อาจมีการเชื่อมโยงไปยังสื่อสังคมออนไลน์
          หรือเว็บไซต์หรือแอปพลิเคชันอื่นๆ ที่จัดทำและให้บริการโดยบุคคลอื่น
          ซึ่งสื่อสังคมออนไลน์
          เว็บไซต์หรือแอปพลิเคชันของบุคคลอื่นนี้จะมีการกำหนดนโยบายความเป็นส่วนตัวแยกต่างหากออกไปจากบริการของ
          สพร. ดังนั้น ท่านต้องศึกษาและทำความเข้าใจอย่างระมัดระวัง
          โดยนโยบายความเป็นส่วนตัวของ สพร. นี้จะใช้กับข้อมูลที่ สพร.
          จัดเก็บบนแอปพลิเคชันนี้ หรือบริการอื่นๆ ที่ สพร. เป็นเจ้าของเท่านั้น
          และนโยบายความเป็นส่วนตัวของ สพร.
          จะไม่ใช้กับเว็บไซต์หรือแอปพลิเคชันของบุคคลอื่น ในที่นี้รวมถึง สพร.
          จะไม่รับผิดชอบแทนบุคคลอื่นในข้อมูลใดๆ
          ที่ท่านได้ให้ไว้กับบุคคลเหล่านั้น
        </p>

        <h2>การเปิดเผยข้อมูล</h2>
        <p>
          ตามนโยบายความเป็นส่วนตัว สพร. จะไม่เผยแพร่ จำหน่าย จ่าย แจก แลกเปลี่ยน
          เช่า หรือถ่ายโอนข้อมูลส่วนตัวใดๆ ของท่านที่ สพร.
          ได้รวบรวมไว้ให้แก่บุคคลภายนอก
          เว้นแต่เมื่อได้รับการร้องขอหรือได้รับการอนุญาตจากท่าน
          หรือภายใต้สถานการณ์เฉพาะ หรือที่กำหนดไว้ภายใต้นโยบายความเป็นส่วนตัวนี้
          ซึ่งรวมถึงแต่ไม่จำกัดเฉพาะ
        </p>

        <p>
          กรณีที่ สพร. เชื่อโดยสุจริตว่าเป็นข้อกำหนดทางกฎหมาย
          เพื่อใช้ในการปรับปรุงการให้บริการนี้ เพื่อใช้ในการวิจัยและพัฒนาบริการ
          ในการส่งเสริมให้เกิดการใช้งานแอปพลิเคชัน
        </p>

        <p>
          สพร. อาจจำเป็นต้องเปิดเผยข้อมูลส่วนตัวของท่านในกรณีที่เป็นคำสั่งศาล
          หมายเรียก หรือการสืบสวนสอบสวนของรัฐบาล นอกจากนี้ สพร.
          ขอสงวนสิทธิ์ในการรายงานแก่หน่วยงานบังคับใช้กฎหมายเกี่ยวกับกิจกรรมใดๆ
          ที่ สพร. เชื่อว่าเป็นสิ่งผิดกฎหมาย สพร.
          อาจเปิดเผยข้อมูลส่วนตัวในกรณีที่จำเป็นเพื่อให้เกิดการปฏิบัติตามหรือเป็นไปตามข้อตกลงการใช้งานของ
          สพร. หรือเพื่อเป็นการปกป้องสิทธิ ทรัพย์สิน และความปลอดภัยของ สพร.
          และผู้ใช้อื่น
        </p>

        <a id="data-exchange">
          <h2>การแลกเปลี่ยนและแบ่งปันข้อมูล</h2>
        </a>
        <p>
          ด้วยข้อมูลของท่านอาจถูกเก็บรักษาในระบบคอมพิวเตอร์หรือเซิร์ฟเวอร์ของ
          สพร. หรือบุคคลที่สามที่ตั้งอยู่ต่างพื้นที่ หรือต่างประเทศ
          หรือต่างเขตอำนาจศาล ดังนั้น ท่านได้ตกลงและยอมรับว่า สพร.
          สามารถโอนถ่ายข้อมูลส่วนตัวของท่าน
          (ระหว่างภายในเขตอำนาจศาลเดียวกันและต่างเขตอำนาจศาลกัน)
          ตามวัตถุประสงค์ที่กล่าวมาในนโยบายนี้
        </p>

        <p>
          นอกจากนี้ สพร.
          อาจนำข้อมูลส่วนตัวของท่านแบ่งปันและแลกเปลี่ยนกับหน่วยงานภาครัฐอื่นๆ
          ซึ่งได้มีการดำเนินภารกิจในการพัฒนาการดำเนินงานภาครัฐร่วมกัน
          เพื่อจุดประสงค์ในการตอบสนองความต้องการ
          และพัฒนาการให้บริการที่มีประสิทธิภาพและมีประโยชน์ต่อผู้ใช้มากยิ่งขึ้นได้
          โดยอาจมีการแจ้งให้ท่านทราบทางอีเมล์ที่ท่านได้ให้ไว้กับ สพร.
          หรือช่องทางอื่นที่ สพร. เห็นสมควร
        </p>

        <a id="changes">
          <h2>การเปลี่ยนแปลง</h2>
        </a>
        <p>
          การปรับปรุงหรือเปลี่ยนแปลงเงื่อนไขของข้อตกลงการใช้งานและนโยบายความเป็นส่วนตัวนี้
          ทาง สพร. มีสิทธิที่จะพิจารณาแก้ไขเปลี่ยนแปลงเมื่อใดก็ได้ตามที่ สพร.
          เห็นสมควร และ สพร.
          จะทำการแจ้งไว้ให้ท่านทราบทางอีเมล์หรือช่องทางอื่นใดที่ สพร. เห็นสมควร
          โดยมีวันที่ของเวอร์ชันล่าสุดกำกับอยู่ตอนท้าย โปรดตรวจสอบเป็นระยะๆ
          ว่าข้อตกลงการใช้งานและนโยบายความเป็นส่วนตัวนี้มีการเปลี่ยนแปลงหรือไม่
        </p>

        <p>
          โดยในการใช้งานแอปพลิเคชันนี้ของท่าน
          ถือเป็นการยอมรับตามข้อตกลงการใช้งานและนโยบายความเป็นส่วนตัวของ สพร.
          หากท่านไม่เห็นด้วยกับข้อตกลงการใช้งานและนโยบายความเป็นส่วนตัวนี้
          โปรดหยุดการใช้บริการ หากท่านยังคงใช้บริการนี้
          ภายหลังจากที่ข้อตกลงการใช้งานและนโยบายความเป็นส่วนตัวนี้มีการแก้ไขและนำขึ้นประกาศผ่านช่องทางในแอปพลิเคชันของ
          สพร. แล้ว ให้ถือว่าท่านยอมรับในการเปลี่ยนแปลงเหล่านั้น
        </p>

        <a id="contact">
          <h2>ติดต่อเรา</h2>
        </a>
        <p>
          หากมีข้อสงสัยใดๆ เกี่ยวกับข้อตกลงการใช้งาน และนโยบายความเป็นส่วนตัวนี้
          โปรดสอบถามได้ที่ DGA Contact Center โทร 02 612 6060 หรือ
          contact@dga.or.th ทาง สพร.
          จะพยายามอย่างเต็มที่ในการแก้ไขข้อกังวลและปัญหาต่างๆ ที่ท่านแจ้งมายัง
          สพร.
        </p>

        <div className="my-20"></div>
      </div>
    </Main>
  );
}
